# Pandas ì™„ë²½ ì •ë¦¬

## í•™ìŠµ ëª©í‘œ
- Pandasì˜ í•µì‹¬ ë°ì´í„° êµ¬ì¡°ì¸ Seriesì™€ DataFrame ì´í•´í•˜ê¸°
- ë°ì´í„° ë¶ˆëŸ¬ì˜¤ê¸°, í™•ì¸, ì„ íƒ, í•„í„°ë§ ë°©ë²• ìµíˆê¸°
- ê²°ì¸¡ì¹˜ ì²˜ë¦¬ ë° ë°ì´í„° ì „ì²˜ë¦¬ ê¸°ìˆ  ìŠµë“
- ê·¸ë£¹í™”(groupby), ë³‘í•©(merge) ë“± ê³ ê¸‰ ë°ì´í„° ì¡°ì‘ ë°©ë²• í•™ìŠµ
- ì‹¤ì „ ë°ì´í„° ë¶„ì„ì„ ìœ„í•œ ê¸°ì´ˆ ë‹¤ì§€ê¸°

## ğŸ’¡ ì´ë¡  ê°œìš”

### Pandasë€?
PandasëŠ” íŒŒì´ì¬ì—ì„œ **êµ¬ì¡°í™”ëœ ë°ì´í„°(í‘œ í˜•íƒœ)**ë¥¼ ì‰½ê³  ì§ê´€ì ìœ¼ë¡œ ë‹¤ë£¨ê¸° ìœ„í•´ ì„¤ê³„ëœ ë¼ì´ë¸ŒëŸ¬ë¦¬ì…ë‹ˆë‹¤. NumPyë¥¼ ê¸°ë°˜ìœ¼ë¡œ ë§Œë“¤ì–´ì¡Œì§€ë§Œ, í–‰ê³¼ ì—´ì— ë ˆì´ë¸”(ì´ë¦„)ì„ ë¶€ì—¬í•˜ì—¬ ë°ì´í„°ë¥¼ ë” ìœ ì—°í•˜ê²Œ ì²˜ë¦¬í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

### ì£¼ìš” íŠ¹ì§•
- **DataFrame**: ì—‘ì…€ì˜ ìŠ¤í”„ë ˆë“œì‹œíŠ¸ì™€ ìœ ì‚¬í•œ 2ì°¨ì› í…Œì´ë¸” êµ¬ì¡°
- **Series**: 1ì°¨ì› ë°°ì—´ êµ¬ì¡° (DataFrameì˜ í•œ ì—´)
- **ê°•ë ¥í•œ ê¸°ëŠ¥**: ê²°ì¸¡ì¹˜ ì²˜ë¦¬, ë°ì´í„° ì •ë ¬, í•„í„°ë§, ê·¸ë£¹í™”, ë³‘í•©, ì‹œê°í™” ë“±
- **ë‹¤ì–‘í•œ í¬ë§· ì§€ì›**: CSV, Excel, SQL, JSON ë“± ë‹¤ì–‘í•œ ì†ŒìŠ¤ì—ì„œ ë°ì´í„° ì½ê¸°/ì“°ê¸° ê°€ëŠ¥

In [1]:
# Pandasì™€ NumPy ë¼ì´ë¸ŒëŸ¬ë¦¬ ë¶ˆëŸ¬ì˜¤ê¸°
import pandas as pd
import numpy as np

print(f"Pandas ë²„ì „: {pd.__version__}")

Pandas ë²„ì „: 2.3.3

## ğŸ“š 1. ë°ì´í„° êµ¬ì¡° (Data Structures)

### 1.1 Series (ì‹œë¦¬ì¦ˆ)
- 1ì°¨ì› ë°ì´í„° êµ¬ì¡°
- ì¸ë±ìŠ¤(Index)ì™€ ê°’(Value)ìœ¼ë¡œ êµ¬ì„±

In [2]:
# ë¦¬ìŠ¤íŠ¸ë¡œ Series ìƒì„±
s = pd.Series([10, 20, 30, 40, 50])
print("ê¸°ë³¸ Series:")
print(s)
print("\nê°’(Values):", s.values)
print("ì¸ë±ìŠ¤(Index):", s.index)

ê¸°ë³¸ Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

ê°’(Values): [10 20 30 40 50]
ì¸ë±ìŠ¤(Index): RangeIndex(start=0, stop=5, step=1)

In [3]:
# ì¸ë±ìŠ¤ë¥¼ ì§€ì •í•˜ì—¬ Series ìƒì„±
s_index = pd.Series([90, 80, 70], index=['Math', 'English', 'Science'])
print("ì¸ë±ìŠ¤ ì§€ì • Series:")
print(s_index)
print("\nMath ì ìˆ˜:", s_index['Math'])

ì¸ë±ìŠ¤ ì§€ì • Series:
Math       90
English    80
Science    70
dtype: int64

Math ì ìˆ˜: 90

### 1.2 DataFrame (ë°ì´í„°í”„ë ˆì„)
- 2ì°¨ì› ë°ì´í„° êµ¬ì¡° (í–‰ê³¼ ì—´)
- ì—¬ëŸ¬ ê°œì˜ Seriesê°€ ëª¨ì—¬ ìˆëŠ” í˜•íƒœ

In [4]:
# ë”•ì…”ë„ˆë¦¬ë¡œ DataFrame ìƒì„±
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

df = pd.DataFrame(data)
print("DataFrame ìƒì„±:")
display(df) # Jupyterì—ì„œëŠ” print(df) ëŒ€ì‹  display(df)ë¥¼ ì“°ë©´ ë” ì˜ˆì˜ê²Œ ë‚˜ì˜µë‹ˆë‹¤

DataFrame ìƒì„±:

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

## ğŸ“š 2. ë°ì´í„° í™•ì¸í•˜ê¸°

ë°ì´í„°ë¥¼ ë¶ˆëŸ¬ì˜¨ í›„ ê°€ì¥ ë¨¼ì € í•´ì•¼ í•  ì¼ì€ ë°ì´í„°ì˜ ìƒê¹€ìƒˆì™€ êµ¬ì¡°ë¥¼ íŒŒì•…í•˜ëŠ” ê²ƒì…ë‹ˆë‹¤.

In [5]:
# ìƒìœ„ 3ê°œ í–‰ í™•ì¸
print("Head (ìƒìœ„ 3ê°œ):")
display(df.head(3))

# í•˜ìœ„ 2ê°œ í–‰ í™•ì¸
print("\nTail (í•˜ìœ„ 2ê°œ):")
display(df.tail(2))

# ë°ì´í„°í”„ë ˆì„ ì •ë³´ í™•ì¸ (í–‰/ì—´ ê°œìˆ˜, ë°ì´í„° íƒ€ì…, ê²°ì¸¡ì¹˜ ë“±)
print("\nInfo:")
df.info()

Head (ìƒìœ„ 3ê°œ):

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

Tail (í•˜ìœ„ 2ê°œ):

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [6]:
# ê¸°ìˆ  í†µê³„ëŸ‰ í™•ì¸ (ìˆ˜ì¹˜í˜• ë°ì´í„°ì˜ ìš”ì•½)
print("Describe:")
display(df.describe())

Describe:

             Age
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

## ğŸ“š 3. ë°ì´í„° ì„ íƒ (Selection)

ì›í•˜ëŠ” ë°ì´í„°ë¥¼ ì½• ì§‘ì–´ë‚´ëŠ” ë°©ë²•ì…ë‹ˆë‹¤. Pandasì—ì„œëŠ” `loc`ì™€ `iloc`ê°€ ê°€ì¥ ì¤‘ìš”í•©ë‹ˆë‹¤.

- **`loc` (Label-based)**: í–‰/ì—´ì˜ **ì´ë¦„(Label)**ìœ¼ë¡œ ì„ íƒ
- **`iloc` (Integer-based)**: í–‰/ì—´ì˜ **ì •ìˆ˜ ì¸ë±ìŠ¤(ìœ„ì¹˜)**ë¡œ ì„ íƒ

In [7]:
# 1. ì—´(Column) ì„ íƒ
print("ì´ë¦„ ì—´ë§Œ ì„ íƒ:")
print(df['Name'])

# ì—¬ëŸ¬ ì—´ ì„ íƒ (ë¦¬ìŠ¤íŠ¸ë¡œ ì „ë‹¬)
print("\nì´ë¦„ê³¼ ë„ì‹œ ì„ íƒ:")
display(df[['Name', 'City']])

ì´ë¦„ ì—´ë§Œ ì„ íƒ:
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

ì´ë¦„ê³¼ ë„ì‹œ ì„ íƒ:

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston

In [8]:
# 2. loc ì‚¬ìš© (ì´ë¦„ìœ¼ë¡œ ì„ íƒ)
# í˜•ì‹: df.loc[í–‰, ì—´]

print("loc[0, 'Name']: ", df.loc[0, 'Name'])  # 0ë²ˆ ì¸ë±ìŠ¤ í–‰ì˜ 'Name' ì—´
print("\nloc[0:2, ['Name', 'Age']]:") # 0ë¶€í„° 2ê¹Œì§€(í¬í•¨!) í–‰
display(df.loc[0:2, ['Name', 'Age']])

loc[0, 'Name']:  Alice

loc[0:2, ['Name', 'Age']]:

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [9]:
# 3. iloc ì‚¬ìš© (ìœ„ì¹˜ ì •ìˆ˜ë¡œ ì„ íƒ)
# í˜•ì‹: df.iloc[í–‰ë²ˆí˜¸, ì—´ë²ˆí˜¸]

print("iloc[0, 0]: ", df.iloc[0, 0])  # 0ë²ˆì§¸ í–‰, 0ë²ˆì§¸ ì—´
print("\niloc[0:2, 0:2]:") # 0ë¶€í„° 2ì „ê¹Œì§€(ë¯¸í¬í•¨!) í–‰
display(df.iloc[0:2, 0:2])

iloc[0, 0]:  Alice

iloc[0:2, 0:2]:

    Name  Age
0  Alice   25
1    Bob   30

In [10]:
# 4. ì¡°ê±´ë¶€ ì„ íƒ (Boolean Indexing)
# ë‚˜ì´ê°€ 30 ì´ìƒì¸ ì‚¬ëŒë§Œ ì„ íƒ
over_30 = df[df['Age'] >= 30]
print("ë‚˜ì´ê°€ 30 ì´ìƒì¸ í–‰:")
display(over_30)

ë‚˜ì´ê°€ 30 ì´ìƒì¸ í–‰:

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

## ğŸ“š 4. ë°ì´í„° ì¡°ì‘ (Manipulation)

ë°ì´í„°ë¥¼ ìˆ˜ì •í•˜ê³ , ì¶”ê°€í•˜ê³ , ì‚­ì œí•˜ëŠ” ë°©ë²•ì…ë‹ˆë‹¤.

In [11]:
# ì—´ ì¶”ê°€
df['Country'] = 'USA'
print("Country ì—´ ì¶”ê°€ í›„:")
display(df)

# ì—´ ì‚­ì œ (drop)
# axis=0: í–‰ ì‚­ì œ, axis=1: ì—´ ì‚­ì œ
df_dropped = df.drop('Country', axis=1)
print("\nCountry ì—´ ì‚­ì œ í›„ (ì›ë³¸ ìœ ì§€):")
display(df_dropped)

# inplace=Trueë¥¼ ì“°ë©´ ì›ë³¸ì´ ë³€ê²½ë¨
# df.drop('Country', axis=1, inplace=True)

Country ì—´ ì¶”ê°€ í›„:

      Name  Age         City Country
0    Alice   25     New York     USA
1      Bob   30  Los Angeles     USA
2  Charlie   35      Chicago     USA
3    David   40      Houston     USA

Country ì—´ ì‚­ì œ í›„ (ì›ë³¸ ìœ ì§€):

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [12]:
# ì •ë ¬ (sort_values)
df_sorted = df.sort_values(by='Age', ascending=False) # ë‚˜ì´ ë‚´ë¦¼ì°¨ìˆœ
print("ë‚˜ì´ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬:")
display(df_sorted)

ë‚˜ì´ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬:

      Name  Age         City Country
3    David   40      Houston     USA
2  Charlie   35      Chicago     USA
1      Bob   30  Los Angeles     USA
0    Alice   25     New York     USA

## ğŸ“š 5. ê²°ì¸¡ì¹˜ ì²˜ë¦¬ (Missing Data)

ì‹¤ì œ ë°ì´í„°ì—ëŠ” ê°’ì´ ë¹„ì–´ìˆëŠ” ê²½ìš°(NaN)ê°€ ë§ìŠµë‹ˆë‹¤. ì´ë¥¼ í™•ì¸í•˜ê³  ì²˜ë¦¬í•˜ëŠ” ê²ƒì€ ë§¤ìš° ì¤‘ìš”í•©ë‹ˆë‹¤.

In [13]:
# ê²°ì¸¡ì¹˜ê°€ í¬í•¨ëœ ë°ì´í„° ìƒì„±
df_missing = df.copy()
df_missing.loc[1, 'Age'] = np.nan
df_missing.loc[3, 'City'] = np.nan

print("ê²°ì¸¡ì¹˜ê°€ ìˆëŠ” ë°ì´í„°:")
display(df_missing)

# ê²°ì¸¡ì¹˜ í™•ì¸ (isna)
print("\nê²°ì¸¡ì¹˜ ì—¬ë¶€ í™•ì¸:")
display(df_missing.isna())

# ê²°ì¸¡ì¹˜ ê°œìˆ˜ í™•ì¸
print("\nì—´ë³„ ê²°ì¸¡ì¹˜ ê°œìˆ˜:")
print(df_missing.isna().sum())

ê²°ì¸¡ì¹˜ê°€ ìˆëŠ” ë°ì´í„°:

      Name   Age         City Country
0    Alice  25.0     New York     USA
1      Bob   NaN  Los Angeles     USA
2  Charlie  35.0      Chicago     USA
3    David  40.0          NaN     USA

ê²°ì¸¡ì¹˜ ì—¬ë¶€ í™•ì¸:

    Name    Age   City  Country
0  False  False  False    False
1  False   True  False    False
2  False  False  False    False
3  False  False   True    False

ì—´ë³„ ê²°ì¸¡ì¹˜ ê°œìˆ˜:
Name       0
Age        1
City       1
Country    0
dtype: int64

In [14]:
# ê²°ì¸¡ì¹˜ ì±„ìš°ê¸° (fillna)
df_filled = df_missing.fillna({'Age': df_missing['Age'].mean(), 'City': 'Unknown'})
print("ê²°ì¸¡ì¹˜ ì±„ìš´ í›„ (ë‚˜ì´ëŠ” í‰ê· , ë„ì‹œëŠ” Unknown):")
display(df_filled)

# ê²°ì¸¡ì¹˜ ì œê±°í•˜ê¸° (dropna)
df_dropped_na = df_missing.dropna()
print("\nê²°ì¸¡ì¹˜ê°€ ìˆëŠ” í–‰ ì œê±° í›„:")
display(df_dropped_na)

ê²°ì¸¡ì¹˜ ì±„ìš´ í›„ (ë‚˜ì´ëŠ” í‰ê· , ë„ì‹œëŠ” Unknown):

      Name        Age         City Country
0    Alice  25.000000     New York     USA
1      Bob  33.333333  Los Angeles     USA
2  Charlie  35.000000      Chicago     USA
3    David  40.000000      Unknown     USA

ê²°ì¸¡ì¹˜ê°€ ìˆëŠ” í–‰ ì œê±° í›„:

      Name   Age      City Country
0    Alice  25.0  New York     USA
2  Charlie  35.0   Chicago     USA

## ğŸ“š 6. ê·¸ë£¹í™” ë° ì§‘ê³„ (Grouping & Aggregation)

ë°ì´í„°ë¥¼ íŠ¹ì • ê¸°ì¤€ìœ¼ë¡œ ë¬¶ì–´ì„œ í†µê³„ëŸ‰ì„ ê³„ì‚°í•  ë•Œ ì‚¬ìš©í•©ë‹ˆë‹¤. (`groupby`)

In [15]:
# ì˜ˆì œ ë°ì´í„° í™•ì¥
df['Department'] = ['HR', 'Engineering', 'Engineering', 'HR']
df['Salary'] = [5000, 7000, 8000, 5500]
print("í™•ì¥ëœ ë°ì´í„°:")
display(df)

# ë¶€ì„œë³„ í‰ê·  ì—°ë´‰ ê³„ì‚°
dept_salary = df.groupby('Department')['Salary'].mean()
print("\në¶€ì„œë³„ í‰ê·  ì—°ë´‰:")
print(dept_salary)

# ì—¬ëŸ¬ í†µê³„ëŸ‰ í•œë²ˆì— ê³„ì‚° (agg)
dept_agg = df.groupby('Department')['Salary'].agg(['mean', 'sum', 'count'])
print("\në¶€ì„œë³„ ì—°ë´‰ í†µê³„:")
display(dept_agg)

í™•ì¥ëœ ë°ì´í„°:

      Name  Age         City Country   Department  Salary
0    Alice   25     New York     USA           HR    5000
1      Bob   30  Los Angeles     USA  Engineering    7000
2  Charlie   35      Chicago     USA  Engineering    8000
3    David   40      Houston     USA           HR    5500

ë¶€ì„œë³„ í‰ê·  ì—°ë´‰:
Department
Engineering    7500.0
HR             5250.0
Name: Salary, dtype: float64

ë¶€ì„œë³„ ì—°ë´‰ í†µê³„:

               mean    sum  count
Department
Engineering  7500.0  15000      2
HR           5250.0  10500      2

## ğŸ“š 7. ë°ì´í„° ë³‘í•© (Merging)

ì—¬ëŸ¬ ê°œì˜ DataFrameì„ í•˜ë‚˜ë¡œ í•©ì¹˜ëŠ” ë°©ë²•ì…ë‹ˆë‹¤. (`concat`, `merge`)

In [16]:
# ë°ì´í„°í”„ë ˆì„ 2ê°œ ìƒì„±
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [3, 4], 'Name': ['Charlie', 'David']})

# ìœ„ì•„ë˜ë¡œ ì´ì–´ ë¶™ì´ê¸° (concat)
df_concat = pd.concat([df1, df2], ignore_index=True)
print("concat ê²°ê³¼:")
display(df_concat)

concat ê²°ê³¼:

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [17]:
# í‚¤(Key)ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ë³‘í•©í•˜ê¸° (merge)
df_info = pd.DataFrame({'ID': [1, 2, 3], 'Role': ['Manager', 'Developer', 'Designer']})

# df_concatê³¼ df_infoë¥¼ 'ID' ê¸°ì¤€ìœ¼ë¡œ ë³‘í•©
df_merged = pd.merge(df_concat, df_info, on='ID', how='left') # left join
print("merge ê²°ê³¼ (Left Join):")
display(df_merged)

merge ê²°ê³¼ (Left Join):

   ID     Name       Role
0   1    Alice    Manager
1   2      Bob  Developer
2   3  Charlie   Designer
3   4    David        NaN

## ğŸ”¥ ì—°ìŠµ ë¬¸ì œ

### ë¬¸ì œ 1: ë°ì´í„° ìƒì„± ë° íƒìƒ‰

In [18]:
# TODO: ë‹¤ìŒ ë”•ì…”ë„ˆë¦¬ë¥¼ ì‚¬ìš©í•˜ì—¬ DataFrameì„ ìƒì„±í•˜ê³ , ê¸°ì´ˆ í†µê³„ëŸ‰(describe)ì„ ì¶œë ¥í•˜ì„¸ìš”.
exam_data = {
    'student_id': [101, 102, 103, 104, 105],
    'score': [85, 90, 78, 92, 88],
    'subject': ['Math', 'Science', 'Math', 'Science', 'Math']
}

# ì—¬ê¸°ì— ì½”ë“œ ì‘ì„±

In [19]:
# í•´ë‹µ
df_exam = pd.DataFrame(exam_data)
print("ìƒì„±ëœ DataFrame:")
display(df_exam)
print("\nê¸°ì´ˆ í†µê³„ëŸ‰:")
display(df_exam.describe())

ìƒì„±ëœ DataFrame:

   student_id  score  subject
0         101     85     Math
1         102     90  Science
2         103     78     Math
3         104     92  Science
4         105     88     Math

ê¸°ì´ˆ í†µê³„ëŸ‰:

       student_id      score
count    5.000000   5.000000
mean   103.000000  86.600000
std      1.581139   5.458938
min    101.000000  78.000000
25%    102.000000  85.000000
50%    103.000000  88.000000
75%    104.000000  90.000000
max    105.000000  92.000000

### ë¬¸ì œ 2: ë°ì´í„° í•„í„°ë§

In [20]:
# TODO: ìœ„ì—ì„œ ë§Œë“  df_examì—ì„œ 'score'ê°€ 90ì  ì´ìƒì¸ í•™ìƒë“¤ë§Œ ì¶œë ¥í•˜ì„¸ìš”.

# ì—¬ê¸°ì— ì½”ë“œ ì‘ì„±

In [21]:
# í•´ë‹µ
high_score = df_exam[df_exam['score'] >= 90]
print("90ì  ì´ìƒì¸ í•™ìƒ:")
display(high_score)

90ì  ì´ìƒì¸ í•™ìƒ:

   student_id  score  subject
1         102     90  Science
3         104     92  Science

### ë¬¸ì œ 3: ê·¸ë£¹í™” ë° í‰ê·  ê³„ì‚°

In [22]:
# TODO: 'subject' ë³„ë¡œ í‰ê·  'score'ë¥¼ ê³„ì‚°í•˜ì„¸ìš”.

# ì—¬ê¸°ì— ì½”ë“œ ì‘ì„±

In [23]:
# í•´ë‹µ
subject_avg = df_exam.groupby('subject')['score'].mean()
print("ê³¼ëª©ë³„ í‰ê·  ì ìˆ˜:")
print(subject_avg)

ê³¼ëª©ë³„ í‰ê·  ì ìˆ˜:
subject
Math       83.666667
Science    91.000000
Name: score, dtype: float64